/**
 * Created by ali on 10/9/17.
 */
module.exports={
    msg : {
        banner:`
        بنر خود را ارسال کنید. چنانچه قصد کنسلی دارید دستور ~resetcmd را بزنید.
         توجه داشته باشید بنر فورواردی را ابتدا به کانال @raazforward ارسال کنید
         سپس لینک آن را بدست آورده و به ربات ارسال کنید.
         درصورت ارسال اشتباه بنر فورواردی به این ربات، لطفا از دستور ~resetcmd استفاده نمایید
        `,
        welcome: 'به ربات تبلیغاتی راز خوش آمدید . تاکنون کانال های زیر برای اکانت شما ثبت شده است .در صورتی که میخواهید کانال بیشتری ثبت کنید و یا اطلاعات کانال موجود را تغییر دهید لطفا به ربات @raaz_variz_bot مراجعه کنید',
        cancel: 'علت کنسل شدن را وارد کنید یا برای لغو کامند زیر را بزنید \r\n /denycancel',
        entermessage: 'متن پیام را وارد کنید یا برای لغو کامند زیر را بزنید \r\n /denymessage',
        pressorderbtn: 'برای مشاهده تبلیغاتی که میتوانید آنها را در کانالتان درج کنید بر روی دکمه لیست تبلیغات کلیک کنید 👇',
        limit: 'محدودیت پست را وارد کنید',
        reply: 'ریپلای را وارد کنید . اگر ریپلای ندارید ~endcommand را بزنید',
        replytype: 'نوع ریپلای را انتخاب کنید',
        date: 'زمان تبلیغ را وارد کنید . مثال : ',
        invalidNumber: 'شماره تبلیغ نزدی یا اشتباه زدی . باید شماره تبلیغو اول متن بزاری',
        orderchannel: `
        #آگهی_تبلیغ برای کانال ~channelname
⚠️این پیام صرفا جهت اطلاع رسانی است و زمان تبلیغ فرا نرسیده است⚠️
برای مشاهده جزییات تبلیغ بر روی دکمه زیر کلیک کنید
        `,
        neworder:`
        #تبلیغ_جدید مخصوص کانال ~channelname
 ~ordernumber
این تبلیغ  ~ordercount کا بوده و مخصوص کانال شماست. لطفا حتما حتما در کانالتان درج کنید چرا که به مشتری تعهد داده شده است. تبلیغ را بدون هماهنگی  در هیچ کانال دیگری درج نکنید.
        `,
        newiorder:`
        #تبلیغ_جدید مخصوص کانال ~channelname
         ~ordernumber
این تبلیغ  ~ordercount کا بوده و مخصوص کانال هایی با دسته  ~ordercat می باشد. 
        `,
        finshing: 'تبلیغ رو به اتمامه. حواست باشه تبلیغ برداری',
        rejected: ' تبلیغ ریجکت شده :‌  ',
        finish: 'تبلیغ تمام شد . لطفا تبلیغ بردار. (برای مشاهده بنر تبلیغ ابتدا بر روی شماره تبلیغ کلیک کن و سپس پست توضیحات را مجددا ببین. بنر بالای پست توضیحات است) ',
        removeorder: ' تبلیغ توسط کانال زیر برداشته شد ',
        stickerdeny: ' استیکر شما توسط مدیر حذف شد ',
        stickerverify: ' استیکر شما توسط مدیر تایید شد ',
        returnorder1: `هشدار! 
تبلیغ شما بعلت برداشتن ناقص بنرها ممکن است بسوزد! لطفا سریع تبلیغ را بصورت کامل در کانال خود درج کنید!`,
        returnorder2: `متاسفانه تبلیغ شما بعلت درج نامناسب در کانال سوخت. اگر مشکلی دارید به ادمین ... پیام دهید.`,
        reminderinprogress: 'تبلیغ جدید داریم. برای مشاهده جزییات روی دکمه شیشه ای کلیک کنید',

        alert: 'شما هنوز تبلیغ را در کانالت درج نکردی ویا آن را اشتباه زدی . لطفا بررسی مجدد کن و دوباره دکمه انجام شد را بزن',
        reject: 'چرا تبلیغ شرکت نمیکنی؟!\r\n❌☠️😱😱😱😱☠️❌\r\n',
        bannerset: 'بنر با موفقیت ثبت شد برای حذف بنر از دستور زیر استفاده کنید\r\n',
        remindyou:' به شما یادآوری خواهد شد',
        bannerSample:'نمونه بنر',
        notexistchannel:'شما هیچ کانال ثبت نامی در ربات ندارد لطفا کانال خودتو در ربات @Raaz_variz_bot ثبت کنید',
        rejectSend:'  درخواست عدم مشارکت شما به مدیریت ارسال شد. امیدواریم راه حلی برای مشکل شما پیدا شود تا بتوانید در تبلیغ شرکت کنید. ',
        done:'با تشکر عملیات انجام شد ',
        sticker:'استیکر خود را ارسال کنید ',
        alertindex:'محدودیت پست رو رعایت نکردی، لطفا تبلیغ رو ریشات بزن تا جریمه نشدی یا تبلیغت بسوزه',
        alertspace:' مابین ریپلای وبنر شما فاصله وجود دارد. لطفا اگه ریشات زدی درست ریشات بزن وگرنه تبلیغاتت کامل میسوزه ',
        orderactivate: `
        ادمین محترم کانال ~channelname
مشکل  ~ordernumber که اعلام کرده بودید
  برطرف شده و تبلیغ برای شما مجددا فعال شد. برای مشاهده جزییات سفارش کلیک کنید.
`,
        screenshot:'لطفا اسکرین شات را ارسال کنید ',
        beforeset:'بنر این تبلیغ قبلا ست شده . اگه میخوای دوباره تبلیغ ست کنی واسش دکمه زیرو بزن ',
        waitforverify:`
        تبلیغ  با موفقیت ثبت شد 
        لطفا مقادیر تبلیغ را بررسی کنید و
        برای تایید
        ~verifycmd
        برای لغو
        ~denycmd
        را بزنید
        `,
        orders:'لیست سفارشات شما . یکی از دکمه های زیر را بزنید',
        notexist:'تبلیغ ~order ندارید',
        varizbot:`تا کنون کانال های زیر برای شما ثبت شده است: 
برای افزودن کانال جدید و یا حذف کانال فعلی خود ، لطفا به ربات واریز به آدرس @raaz_variz_bot مراجعه نمایید. توجه کنید چنانچه تبلیغ را بصورت مشترک در کانال دیگر خود میزنید میتوانید از فیلد کانال های مشترک در هنگام ثبت کانال استفاده کنید و نیازی به ثبت مجدد تگ مربوطه نیست. 

شرایط ثبت کانال : 
- کانال #اخلاقی بالای 20 هزار عضو و کانال رمان بالای 40 هزار عضو`,
        setverify:'با تشکر از اینکه تبلیغ را در کانال خود درج کردید. زمان اتمام تبلیغ به شما اطلاع رسانی خواهد شد',
        bannerdelete:'تبلیغ مورد نظر تغییر کرده  یا تمام شده است . در صورت تغییر , تبلیغ جدید برای شما ارسال میشود',
    },
    consts:{
        replytype:"بنر و ریپلای",
        stickertype:"بنر و استیکر",
        bannertype:"بنر ",

    },
    markups:{
        getOrders:bot.keyboard([
            ['گرفتن تبلیغ جدید','تبلیغات به زودی'],
            ['تبلیغات پایان یافته من','تبلیغات جاری من'],
            ['افزودن/حذف کانال'],
                ['تغییر استیکر']
        ], {resize: true}),
        getOprations:bot.keyboard([
            ['تبلیغات جدید','تبلیغات جاری'],
            ['ارسال پیام','تغییر استیکر']
        ], {resize: true}),
    }
}

